from django.conf import settings

DISTRICTS = {
    "1": "港島中西區",
    "2": "港島東區",
    "3": "港島南區",
    "4": "港島灣仔區",
    "5": "九龍九龍城區",
    "6": "九龍觀塘區",
    "7": "九龍深水埗區",
    "8": "九龍黃大仙區",
    "9": "九龍油尖旺區",
    "10": "新界離島區",
    "11": "新界葵青區",
    "12": "新界北區",
    "13": "新界西貢區",
    "14": "新界沙田區",
    "15": "新界大埔區",
    "16": "新界荃灣區",
    "17": "新界屯門區",
    "18": "新界元朗區"
}

DISTRICT_CHOICES = (
    ("1", "港島中西區"),
    ("2", "港島東區"),
    ("3", "港島南區"),
    ("4", "港島灣仔區"),
    ("5", "九龍九龍城區"),
    ("6", "九龍觀塘區"),
    ("7", "九龍深水埗區"),
    ("8", "九龍黃大仙區"),
    ("9", "九龍油尖旺區"),
    ("10", "新界離島區"),
    ("11", "新界葵青區"),
    ("12", "新界北區"),
    ("13", "新界西貢區"),
    ("14", "新界沙田區"),
    ("15", "新界大埔區"),
    ("16", "新界荃灣區"),
    ("17", "新界屯門區"),
    ("18", "新界元朗區")
)


def find_district(district_number) :
    return DISTRICTS[district_number]


def get_geographic_srid():
    return getattr(settings, 'STORES_GEOGRAPHIC_SRID', 3577)


def get_geodetic_srid():
    return getattr(settings, 'STORES_GEODETIC_SRID', 4326)
